{
  "$meta": {
    "description": "A `blockchain` object can be obtained by using [include_lib](#GENERAL_INCLUDE_LIB). The `classID` used for this object is `\"blockchainLib\"`."
  },
  "coin_price": {
    "description": "Returns a `number` representing the current unit value of the cryptocurrency. In case of an error, a `string` with the error details will be returned. If the provided `coinName` is anything other than a `string`, the method will return `null`."
  },
  "show_history": {
    "description": "Returns a `map` with the latest changes in the value of a specific cryptocurrency. The key of the `map` is an index represented by a `number`. The value is a `list`, where index 0 is the historical price of the coin, and index 1 is the date when the price change occurred. If the provided `coinName` is anything other than a `string`, the method will return `null`."
  },
  "amount_mined": {
    "description": "Returns a `number` representing the total amount of mined coins. If the provided `coinName` is anything other than a `string`, the method will return `null`."
  },
  "get_coin": {
    "description": "This method returns a `coin` object used to manage the currency. In case of an error, a `string` with the details will be returned. If any of the provided parameters are `null`, the method will return `null`."
  },
  "login_wallet": {
    "description": "Returns a `wallet` object on success. In case of an error, a `string` indicating the reason will be returned. If any of the provided parameters has a type that deviates from the defined signature, the method will return `null`."
  },
  "create_wallet": {
    "description": "Returns a `wallet` object, which can be used to manage cryptocurrencies. In case of an error, a `string` with the details will be returned. If any of the provided parameters has a type that deviates from the defined signature, the method will return `null`."
  },
  "delete_coin": {
    "description": "This method removes a cryptocurrency from the world. It is required to provide the credentials used in the creation of the cryptocurrency. On success, this method will return a `number` with the value one. On failure, a `string` containing details will be returned. If any of the provided parameters have a type that deviates from the defined signature, the method will return `null`."
  }
}